Конфигурация/InformationRegisters/УсловияСделокСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСНедвижимостью</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктПриемаПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОГосРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НазначениеОбъектаНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтроительствоЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЕГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастроваяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогаНаИмущество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетНалогаПоКадастровойСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СтавкиНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка09</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка15</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка30</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка35</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СделкаСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СделкаСНедвижимостью</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ГрафикиПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расторжение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПраваНаНедвижимость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПравНаНедвижимость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Срок</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСНалогамиКлиентСервер/Ext/Module.bsl
// Возвращает ставку налога на доходы физ. лиц (НДФЛ) в процентах
//
// Параметры:
//  СтавкаНДФЛ - ссылка на перечисление "Ставки НДФЛ"
//
// Возвращаемое значение:
//  Число - ставка налога в процентах
//
Функция ПолучитьСтавкуНДФЛ(СтавкаНДФЛ) Экспорт
	
	Если 	  СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка13") Тогда
		Возврат 13;
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка09") Тогда
		Возврат 9;
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка15") Тогда
		Возврат 15;
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка30") Тогда
		Возврат 30;		
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка35") Тогда
		Возврат 35;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // СтавкаНДФЛ

// Возвращает ставку налога на добавленную стоимость (НДС) в процентах
//
// Параметры:
//  СтавкаНДС - ссылка на перечисление "Ставки НДС"
//
// Возвращаемое значение:
//  Число - ставка налога в процентах
//
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт

	Если      СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5") Тогда
		Возврат 5;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7") Тогда
		Возврат 7;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Возврат 18;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		Возврат 20;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22") Тогда
		Возврат 22;
	КонецЕсли;

	Возврат 0;

КонецФункции

//возвращает сумму налога с дивидендов
Функция РасчетНалогаСДивидендов(СуммаНачисленная, ВидДоговора, параметрД1, параметрД2) Экспорт
	
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда")
		ИЛИ ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР")
		ИЛИ ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями")
		ИЛИ ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов") Тогда
		Налог = 0;
	Иначе
		Если параметрД1 > 0 Тогда 
			Налог = Окр(СуммаНачисленная / параметрД1 * (параметрД1 - параметрД2) * 0.13, 0);	
		Иначе
			Налог = Окр(СуммаНачисленная * 0.13, 0);	
		КонецЕсли;	
	КонецЕсли;
	
	Если Налог < 0 Тогда 
		Налог = 0;
	КонецЕсли;	
	
	Возврат Налог;
	
КонецФункции	

Функция ЧисловоеЗначениеСтавкиНДФЛ(СтавкаНДФЛ) Экспорт
	
	Если СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка0") Тогда 
		Возврат 0;
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка09") Тогда
		Возврат 0.09;
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка13") Тогда
		Возврат 0.13
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка15") Тогда
		Возврат 0.15
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка30") Тогда 
		Возврат 0.3
	ИначеЕсли СтавкаНДФЛ = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка35") Тогда
		Возврат 0.35
	КонецЕсли;
	
КонецФункции

Функция ПорогПримененияСтавкиНДФЛ15Процентов(Период, ОсновнаяСтавка) Экспорт

	ПороговаяСумма = 0;
	
	Если ОсновнаяСтавка = ПредопределенноеЗначение("Перечисление.СтавкиНДФЛ.Ставка30") Тогда
		//это нерезидент
		Возврат 0;
	КонецЕсли;
	
	Если Период >= Дата(2025,1,1) Тогда
		ПороговаяСумма = 2400000;
	ИначеЕсли Период >= Дата(2021,1,1) Тогда
		ПороговаяСумма = 5000000;
	КонецЕсли;
	
	Возврат ПороговаяСумма;
	
КонецФункции

Функция ПолучитьВидВыручки(ДокументСсылка, Отказ) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыВыручки.ОказаниеУслугАренды");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("не удалось определить вид выручки для документа "+ДокументСсылка, ДокументСсылка,,,Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСрокОплатыНДФЛ(Период) Экспорт
	
	Результат = Неопределено;
	
	Если Период < Дата(2023,1,1) Тогда
		Результат =  Период;
	Иначе
		Месяц 	= Месяц(Период);
		День 	= День(Период);
		Год 	= Год(Период);
		
		Если Месяц = 1 И 1 <= День И День <= 22 Тогда
			Результат =  Дата(Год, 1, 28);
		ИначеЕсли Месяц = 12 И 23 <= День И День <= 31 Тогда
			Результат =  Дата(Год, 1, 28);
		ИначеЕсли 23 <= День И День <= 31 Тогда
			Результат = ДобавитьМесяц(Дата(Год, Месяц, 28), 1);
		Иначе
			Результат = Дата(Год, Месяц, 28);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, Результат, -1);
	
КонецФункции

&НаСервере
Процедура ПолучитьИмуществоИДатыПоступленияВыбытия(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ)
	
	НачалоУчетаПоСчетуДУ = СчетДоверительногоУправления.ДатаЗаключения;
	КонецТекущегоКвартала = КонецКвартала(Период);
	
	#Область ЗапросПоОбъектамНедвижимости
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Документ.СделкаСНедвижимостью).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА 1
		|		КОГДА УсловияСделокСНедвижимостьюСрезПоследних.Основание ССЫЛКА Документ.ЗаявкаПайщика
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК Движение,
		|	ВЫБОР
		|		КОГДА РеквизитыОбъектовНедвижимостиСрезПоследних.РасчетНалогаПоКадастровойСтоимости
		|			ТОГДА УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности.Дата
		|		ИНАЧЕ ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи.Дата, УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности.Дата)
		|	КОНЕЦ КАК Дата
		|ПОМЕСТИТЬ _ДвиженияОС
		|ИЗ
		|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ОбъектНедвижимости.ВидОбъектаНедвижимости <> ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.ЗемельныйУчасток)) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО (РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
		|ГДЕ
		|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|	И (УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности <> ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.ПустаяСсылка)
		|			ИЛИ УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи <> ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияОС.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД) > &НачалоУчетаПоСчетуДУ
		|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&КонецПериода, ГОД), СЕКУНДА, -1)
		|		ИНАЧЕ &НачалоУчетаПоСчетуДУ
		|	КОНЕЦ КАК НачалоПериода,
		|	СУММА(ВЫБОР
		|			КОГДА _ДвиженияОС.Дата < НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
		|				ТОГДА _ДвиженияОС.Движение
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстатокНачалоГода,
		|	СУММА(ВЫБОР
		|			КОГДА _ДвиженияОС.Дата < &КонецПериода
		|				ТОГДА _ДвиженияОС.Движение
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстатокКонецПериода,
		|	&КонецПериода КАК ОкончаниеПериода
		|ПОМЕСТИТЬ _ОстаткиОбъектовНедвижимости
		|ИЗ
		|	_ДвиженияОС КАК _ДвиженияОС
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДвиженияОС.ОбъектНедвижимости
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВЫБОР
		|				КОГДА _ДвиженияОС.Дата < НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
		|					ТОГДА _ДвиженияОС.Движение
		|				ИНАЧЕ 0
		|			КОНЕЦ) <> 0
		|		ИЛИ СУММА(ВЫБОР
		|				КОГДА _ДвиженияОС.Дата < &КонецПериода
		|					ТОГДА _ДвиженияОС.Движение
		|				ИНАЧЕ 0
		|			КОНЕЦ) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиОбъектовНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ОстаткиОбъектовНедвижимости.ОбъектНедвижимости.Представление КАК ОбъектНедвижимостиПредставление
		|ПОМЕСТИТЬ _ОстаткиОбъектовОтрицательные
		|ИЗ
		|	_ОстаткиОбъектовНедвижимости КАК _ОстаткиОбъектовНедвижимости
		|ГДЕ
		|	_ОстаткиОбъектовНедвижимости.ОстатокКонецПериода < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиОбъектовНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ОстаткиОбъектовНедвижимости.НачалоПериода КАК НачалоПериода,
		|	ВЫБОР
		|		КОГДА _ОстаткиОбъектовНедвижимости.ОстатокКонецПериода = 1
		|			ТОГДА _ОстаткиОбъектовНедвижимости.ОстатокКонецПериода
		|		ИНАЧЕ _ОстаткиОбъектовНедвижимости.ОстатокНачалоГода
		|	КОНЕЦ КАК Остаток,
		|	_ОстаткиОбъектовНедвижимости.ОкончаниеПериода КАК ОкончаниеПериода,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПереходаПрава,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВыбытия
		|ПОМЕСТИТЬ _ОстаткиНедвижимостиДляРасчета
		|ИЗ
		|	_ОстаткиОбъектовНедвижимости КАК _ОстаткиОбъектовНедвижимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияОС.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ДвиженияОС.Дата КАК Дата,
		|	_ДвиженияОС.Движение КАК НаправлениеДвижения,
		|	_ДвиженияОС.ОбъектНедвижимости.Представление КАК ОбъектНедвижимостиПредставление
		|ПОМЕСТИТЬ _ДвиженияОбъектовНедвижимости
		|ИЗ
		|	_ДвиженияОС КАК _ДвиженияОС
		|ГДЕ
		|	_ДвиженияОС.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&КонецПериода, ГОД) И &КонецПериода";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("КонецПериода", КонецТекущегоКвартала);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоУчетаПоСчетуДУ", НачалоУчетаПоСчетуДУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ОстаткиОбъектовОтрицательные").Выбрать(); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По объекту недвижимости " 
			+ ВыборкаДетальныеЗаписи.ОбъектНедвижимостиПредставление + " обнаружен отрицательный остаток! ",,,,Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРасчетаНалога = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ОстаткиНедвижимостиДляРасчета").Выгрузить();
	
	ВыборкаДетальныеЗаписи = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ДвиженияОбъектовНедвижимости",,,,"ОбъектНедвижимости, Дата").Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокиОбъекта = ТаблицаРасчетаНалога.НайтиСтроки(новый Структура("ОбъектНедвижимости", ВыборкаДетальныеЗаписи.ОбъектНедвижимости));
		КоличествоСтрок = СтрокиОбъекта.Количество();
		Если КоличествоСтрок > 0 И ВыборкаДетальныеЗаписи.НаправлениеДвижения = -1 Тогда
			Строка = СтрокиОбъекта[КоличествоСтрок - 1];
			Если Строка.ОкончаниеПериода < КонецТекущегоКвартала Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект недвижимости " 
					+ ВыборкаДетальныеЗаписи.ОбъектНедвижимостиПредставление + " не числится в собственности на дату " 
					+ ВыборкаДетальныеЗаписи.Дата + "! ",,,,Отказ);
			Иначе
				Строка.ДатаВыбытия = ВыборкаДетальныеЗаписи.Дата;
				Строка.ОкончаниеПериода = ВыборкаДетальныеЗаписи.Дата;
			КонецЕсли;
		ИначеЕсли ВыборкаДетальныеЗаписи.НаправлениеДвижения = 1 Тогда
			
			Если КоличествоСтрок > 0 Тогда
				Строка = СтрокиОбъекта[КоличествоСтрок - 1];
				Строка.НачалоПериода = ?(ВыборкаДетальныеЗаписи.Дата < НачалоУчетаПоСчетуДУ, НачалоУчетаПоСчетуДУ, ВыборкаДетальныеЗаписи.Дата); 
				Строка.ДатаПереходаПрава = ВыборкаДетальныеЗаписи.Дата;    
				//Работает для кадастровой стоимости. Кая будет для среднегодовой - пока не ясно. 
			КонецЕсли;
			
		Иначе	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект недвижимости " 
				+ ВыборкаДетальныеЗаписи.ОбъектНедвижимостиПредставление + " совсем не числится в собственности на дату " 
				+ ВыборкаДетальныеЗаписи.Дата + "! ",,,,Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаРасчетаНалога, "_ИмуществоИДатыПоступленияВыбытия", Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьТаблицуЛьготПоОбъектамНедвижимости() 
	// хардкод для обного объекта 
	
	ТаблицаЛьготы = Новый ТаблицаЗначений;
	ТаблицаЛьготы.Колонки.Добавить("ОбъектНедвижимости",	 Новый ОписаниеТипов("СправочникСсылка.ОбъектыНедвижимости")); 
	ТаблицаЛьготы.Колонки.Добавить("Льгота", 				 Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(5,2,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЛьготы.Колонки.Добавить("НачалоПериодаЛьготы", 	 Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЛьготы.Колонки.Добавить("ОкончаниеПериодаЛьготы", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	НоваяСтрока = ТаблицаЛьготы.Добавить();
	НоваяСтрока.ОбъектНедвижимости = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОбъектНедвижимостиМоскваБахрушина13кв19");
	НоваяСтрока.Льгота = 100;
	НоваяСтрока.НачалоПериодаЛьготы = Дата(2024, 8, 7);
	НоваяСтрока.ОкончаниеПериодаЛьготы = Дата(2026, 12, 31);
	
	НоваяСтрока = ТаблицаЛьготы.Добавить();
	НоваяСтрока.ОбъектНедвижимости = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОбъектНедвижимостиМоскваКосмодамианская4_22кв40");
	НоваяСтрока.Льгота = 100;
	НоваяСтрока.НачалоПериодаЛьготы = Дата(2026, 3, 1);
	НоваяСтрока.ОкончаниеПериодаЛьготы = Дата(2026, 12, 31);

	НоваяСтрока = ТаблицаЛьготы.Добавить();
	НоваяСтрока.ОбъектНедвижимости = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОбъектНедвижимостиМоскваКосмодамианская4_22кв41");
	НоваяСтрока.Льгота = 100;
	НоваяСтрока.НачалоПериодаЛьготы = Дата(2026, 3, 1);
	НоваяСтрока.ОкончаниеПериодаЛьготы = Дата(2026, 12, 31);
	
	Возврат ТаблицаЛьготы;  	
	
КонецФункции

&НаСервере
Процедура ПолучитьАвансовыеПлатежиИРеквизитыОбъектов(Период, Организация, СчетДоверительногоУправления, Запрос)
	
	//_РеквизитыОбъектовНедвижимости ? вызывает ыопросы. СрезПервых и СрезПослених на одну дату? 
	ТаблицаЛьготы =  ПолучитьТаблицуЛьготПоОбъектамНедвижимости();  
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаЛьготы, "_ТаблицаЛьготы", Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияНалоговОбороты.СубъектАналитики КАК ОбъектНедвижимости,
		|	НачисленияНалоговОбороты.СуммаОборот КАК СуммаОборот,
		|	НачисленияНалоговОбороты.Основание КАК Основание,
		|	НачислениеЗадолженности.ОкончаниеПериодаНачисления КАК ОкончаниеПериодаНачисления,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.РасчетНалогаПоКадастровойСтоимости КАК РасчетНалогаПоКадастровойСтоимости
		|ПОМЕСТИТЬ _АвансовыеПлатежи
		|ИЗ
		|	РегистрНакопления.НачисленияНалогов.Обороты(
		|			&НачалоГода,
		|			&ДоНачисления,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаИмущество)) КАК НачисленияНалоговОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ПО НачисленияНалоговОбороты.Основание = НачислениеЗадолженности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО НачисленияНалоговОбороты.СубъектАналитики = РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
		|ГДЕ
		|	КВАРТАЛ(&КонецПериода) = 4
		|	И ГОД(НачислениеЗадолженности.НачалоПериодаНачисления) = ГОД(&КонецПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СписокОбъектов.ОбъектНедвижимости КАК ОбъектНедвижимости
		|ПОМЕСТИТЬ _ОбъектыНедвижимостиВсе
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости КАК ОбъектНедвижимости
		|	ИЗ
		|		_ИмуществоИДатыПоступленияВыбытия КАК _ИмуществоИДатыПоступленияВыбытия
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_АвансовыеПлатежи.ОбъектНедвижимости
		|	ИЗ
		|		_АвансовыеПлатежи КАК _АвансовыеПлатежи) КАК СписокОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.РасчетНалогаПоКадастровойСтоимости, РеквизитыОбъектовНедвижимостиСрезПервых.РасчетНалогаПоКадастровойСтоимости) КАК РасчетПоКадастровойСтоимости,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.СтавкаНалогаНаИмущество, РеквизитыОбъектовНедвижимостиСрезПервых.СтавкаНалогаНаИмущество) КАК СтавкаНалога,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.КадастроваяСтоимость, РеквизитыОбъектовНедвижимостиСрезПервых.КадастроваяСтоимость) КАК КадастроваяСтоимость,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.КодОКТМО, РеквизитыОбъектовНедвижимостиСрезПервых.КодОКТМО) КАК КодОКТМО,
		|	ЕСТЬNULL(_ТаблицаЛьготы.Льгота, 0) КАК Льгота,
		|	ЕСТЬNULL(_ТаблицаЛьготы.НачалоПериодаЛьготы, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоПериодаЛьготы,
		|	ЕСТЬNULL(_ТаблицаЛьготы.ОкончаниеПериодаЛьготы, ДАТАВРЕМЯ(1, 1, 1)) КАК ОкончаниеПериодаЛьготы
		|ПОМЕСТИТЬ _РеквизитыОбъектовНедвижимости
		|ИЗ
		|	_ОбъектыНедвижимостиВсе КАК _ОбъектыНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПервых(
		|				&НачалоГода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ОбъектНедвижимости В
		|						(ВЫБРАТЬ
		|							_ОбъектыНедвижимостиВсе.ОбъектНедвижимости
		|						ИЗ
		|							_ОбъектыНедвижимостиВсе КАК _ОбъектыНедвижимостиВсе)) КАК РеквизитыОбъектовНедвижимостиСрезПервых
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = РеквизитыОбъектовНедвижимостиСрезПервых.ОбъектНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&НачалоГода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ОбъектНедвижимости В
		|						(ВЫБРАТЬ
		|							_ОбъектыНедвижимостиВсе.ОбъектНедвижимости
		|						ИЗ
		|							_ОбъектыНедвижимостиВсе КАК _ОбъектыНедвижимостиВсе)) КАК РеквизитыОбъектовНедвижимостиСрезНаНачалоГода
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.ОбъектНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаЛьготы КАК _ТаблицаЛьготы
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = _ТаблицаЛьготы.ОбъектНедвижимости";
	
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(Период));
	Запрос.УстановитьПараметр("ДоНачисления", Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНалогНаИмуществоПоКадастровойСтоимости(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ)
		
	#Область ЗапросРасчетпоКадастровой
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_РеквизитыОбъектовНедвижимости.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	_РеквизитыОбъектовНедвижимости.КодОКТМО КАК КодОКТМО,
		|	_РеквизитыОбъектовНедвижимости.РасчетПоКадастровойСтоимости КАК РасчетПоКадастровойСтоимости,
		|	ВЫБОР
		|		КОГДА ГОД(_ИмуществоИДатыПоступленияВыбытия.НачалоПериода) = ГОД(&КонецПериода)
		|			ТОГДА МЕСЯЦ(_ИмуществоИДатыПоступленияВыбытия.НачалоПериода) + ВЫБОР
		|					КОГДА ДЕНЬ(_ИмуществоИДатыПоступленияВыбытия.НачалоПериода) > 15
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК МесяцНачалаДляКадастровой,
		|	МЕСЯЦ(_ИмуществоИДатыПоступленияВыбытия.ОкончаниеПериода) + ВЫБОР
		|		КОГДА ДЕНЬ(_ИмуществоИДатыПоступленияВыбытия.ОкончаниеПериода) < 15
		|			ТОГДА -1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК МесяцОкончанияДляКадастровой,
		|	ВЫБОР
		|		КОГДА &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, ГОД)
		|			ТОГДА 1
		|		ИНАЧЕ 3 * КВАРТАЛ(&КонецПериода) - 2
		|	КОНЕЦ КАК МесяцНачалаПериодаПоКадастру,
		|	_РеквизитыОбъектовНедвижимости.СтавкаНалога КАК СтавкаНалога,
		|	_ИмуществоИДатыПоступленияВыбытия.ДатаПереходаПрава КАК ДатаПереходаПрава,
		|	_ИмуществоИДатыПоступленияВыбытия.ДатаВыбытия КАК ДатаВыбытия,
		|	_РеквизитыОбъектовНедвижимости.Льгота КАК Льгота,
		|	_РеквизитыОбъектовНедвижимости.НачалоПериодаЛьготы КАК НачалоПериодаЛьготы,
		|	_РеквизитыОбъектовНедвижимости.ОкончаниеПериодаЛьготы КАК ОкончаниеПериодаЛьготы
		|ПОМЕСТИТЬ _ПериодыРасчетаПоКадастру
		|ИЗ
		|	_ИмуществоИДатыПоступленияВыбытия КАК _ИмуществоИДатыПоступленияВыбытия
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОбъектовНедвижимости КАК _РеквизитыОбъектовНедвижимости
		|		ПО _ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости = _РеквизитыОбъектовНедвижимости.ОбъектНедвижимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыРасчетаПоКадастру.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, МесяцыГода.Месяц - 1) КАК Месяц,
		|	ВЫБОР
		|		КОГДА МесяцыГода.Месяц >= _ПериодыРасчетаПоКадастру.МесяцНачалаДляКадастровой
		|				И МесяцыГода.Месяц <= _ПериодыРасчетаПоКадастру.МесяцОкончанияДляКадастровой
		|			ТОГДА _ПериодыРасчетаПоКадастру.КадастроваяСтоимость * _ПериодыРасчетаПоКадастру.СтавкаНалога / 100 / 12 * ВЫБОР
		|					КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, МесяцыГода.Месяц) > _ПериодыРасчетаПоКадастру.НачалоПериодаЛьготы
		|							И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, МесяцыГода.Месяц - 1) <= _ПериодыРасчетаПоКадастру.ОкончаниеПериодаЛьготы
		|						ТОГДА (100 - _ПериодыРасчетаПоКадастру.Льгота) / 100
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНалога
		|ПОМЕСТИТЬ _РасчетНалогаПоКадастровойПоМесяцам
		|ИЗ
		|	_ПериодыРасчетаПоКадастру КАК _ПериодыРасчетаПоКадастру
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			МЕСЯЦ(ДанныеКалендаря.Дата) КАК Месяц
		|		ИЗ
		|			РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ГДЕ
		|			ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|			И ДанныеКалендаря.Дата >= НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
		|			И ДанныеКалендаря.Дата <= &КонецПериода) КАК МесяцыГода
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоКадастровойПоМесяцам.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	НАЧАЛОПЕРИОДА(_РасчетНалогаПоКадастровойПоМесяцам.Месяц, КВАРТАЛ) КАК Квартал,
		|	ВЫРАЗИТЬ(СУММА(_РасчетНалогаПоКадастровойПоМесяцам.СуммаНалога) КАК ЧИСЛО(15, 0)) КАК СуммаНалога
		|ПОМЕСТИТЬ _РасчетНалогаПоКадастровойПоКварталам
		|ИЗ
		|	_РасчетНалогаПоКадастровойПоМесяцам КАК _РасчетНалогаПоКадастровойПоМесяцам
		|ГДЕ
		|	МЕСЯЦ(_РасчетНалогаПоКадастровойПоМесяцам.Месяц) <= 9
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасчетНалогаПоКадастровойПоМесяцам.ОбъектНедвижимости,
		|	НАЧАЛОПЕРИОДА(_РасчетНалогаПоКадастровойПоМесяцам.Месяц, КВАРТАЛ)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_РасчетНалогаПоКадастровойПоМесяцам.ОбъектНедвижимости,
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&КонецПериода, ГОД), КВАРТАЛ),
		|	ВЫРАЗИТЬ(СУММА(_РасчетНалогаПоКадастровойПоМесяцам.СуммаНалога - ВЫБОР
		|				КОГДА МЕСЯЦ(_РасчетНалогаПоКадастровойПоМесяцам.Квартал) < 10
		|					ТОГДА _РасчетНалогаПоКадастровойПоМесяцам.СуммаНалогаОкр
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК ЧИСЛО(15, 0))
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РасчетНалогаПоКадастровойПоМесяцам.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|		НАЧАЛОПЕРИОДА(_РасчетНалогаПоКадастровойПоМесяцам.Месяц, КВАРТАЛ) КАК Квартал,
		|		ВЫРАЗИТЬ(СУММА(_РасчетНалогаПоКадастровойПоМесяцам.СуммаНалога) КАК ЧИСЛО(15, 0)) КАК СуммаНалогаОкр,
		|		СУММА(_РасчетНалогаПоКадастровойПоМесяцам.СуммаНалога) КАК СуммаНалога
		|	ИЗ
		|		_РасчетНалогаПоКадастровойПоМесяцам КАК _РасчетНалогаПоКадастровойПоМесяцам
		|	ГДЕ
		|		&КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, ГОД)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_РасчетНалогаПоКадастровойПоМесяцам.ОбъектНедвижимости,
		|		НАЧАЛОПЕРИОДА(_РасчетНалогаПоКадастровойПоМесяцам.Месяц, КВАРТАЛ)) КАК _РасчетНалогаПоКадастровойПоМесяцам
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасчетНалогаПоКадастровойПоМесяцам.ОбъектНедвижимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыРасчетаПоКадастру.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ПериодыРасчетаПоКадастру.СтавкаНалога КАК СтавкаНалога,
		|	_ПериодыРасчетаПоКадастру.КодОКТМО КАК КодОКТМО,
		|	(ВЫБОР
		|		КОГДА _ПериодыРасчетаПоКадастру.МесяцОкончанияДляКадастровой < МЕСЯЦ(&КонецПериода)
		|			ТОГДА _ПериодыРасчетаПоКадастру.МесяцОкончанияДляКадастровой
		|		ИНАЧЕ МЕСЯЦ(&КонецПериода)
		|	КОНЕЦ - ВЫБОР
		|		КОГДА _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру < _ПериодыРасчетаПоКадастру.МесяцНачалаДляКадастровой
		|			ТОГДА _ПериодыРасчетаПоКадастру.МесяцНачалаДляКадастровой
		|		ИНАЧЕ _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру
		|	КОНЕЦ + 1) / (МЕСЯЦ(&КонецПериода) - _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру + 1) КАК КоэффициентВладения,
		|	_ПериодыРасчетаПоКадастру.КадастроваяСтоимость КАК БазаНалога,
		|	ЕСТЬNULL(_РасчетНалогаПоКадастровойПоКварталам.СуммаНалога, 0) КАК СуммаНалога,
		|	ЕСТЬNULL(_АвансовыеПлатежи.СуммаОборот, 0) КАК СуммаАванса
		|ПОМЕСТИТЬ _РасчетНалогаПоКадастровойСтоимости
		|ИЗ
		|	_ПериодыРасчетаПоКадастру КАК _ПериодыРасчетаПоКадастру
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасчетНалогаПоКадастровойПоКварталам КАК _РасчетНалогаПоКадастровойПоКварталам
		|		ПО _ПериодыРасчетаПоКадастру.ОбъектНедвижимости = _РасчетНалогаПоКадастровойПоКварталам.ОбъектНедвижимости
		|			И (_РасчетНалогаПоКадастровойПоКварталам.Квартал = НАЧАЛОПЕРИОДА(&КонецПериода, КВАРТАЛ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_АвансовыеПлатежи.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|			СУММА(_АвансовыеПлатежи.СуммаОборот) КАК СуммаОборот
		|		ИЗ
		|			_АвансовыеПлатежи КАК _АвансовыеПлатежи
		|		ГДЕ
		|			_АвансовыеПлатежи.РасчетНалогаПоКадастровойСтоимости
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_АвансовыеПлатежи.ОбъектНедвижимости) КАК _АвансовыеПлатежи
		|		ПО _ПериодыРасчетаПоКадастру.ОбъектНедвижимости = _АвансовыеПлатежи.ОбъектНедвижимости
		|ГДЕ
		|	_ПериодыРасчетаПоКадастру.РасчетПоКадастровойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоКадастровойСтоимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ВЫРАЗИТЬ(_РасчетНалогаПоКадастровойСтоимости.ОбъектНедвижимости КАК Справочник.ОбъектыНедвижимости).Представление КАК ОбъектНедвижимостиПредставление,
		|	_РасчетНалогаПоКадастровойСтоимости.СтавкаНалога = 0 КАК НеУказанаСтавкаНалога,
		|	_РасчетНалогаПоКадастровойСтоимости.БазаНалога = 0 КАК НеУказанаКадастроваяСтоимость
		|ИЗ
		|	_РасчетНалогаПоКадастровойСтоимости КАК _РасчетНалогаПоКадастровойСтоимости
		|ГДЕ
		|	(_РасчетНалогаПоКадастровойСтоимости.СтавкаНалога = 0
		|			ИЛИ _РасчетНалогаПоКадастровойСтоимости.БазаНалога = 0)";
	
	#КонецОбласти	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НеУказанаКадастроваяСтоимость Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + Выборка.ОбъектНедвижимостиПредставление 
				+ " не указана кадастровая стоимость!", Выборка.ОбъектНедвижимости,,, Отказ);
		КонецЕсли;
		Если Выборка.НеУказанаСтавкаНалога Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + Выборка.ОбъектНедвижимостиПредставление 
				+ " не указана ставка налога!", Выборка.ОбъектНедвижимости,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНалогНаИмуществоПоСреднегодовойСтоимости(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ)
	
	ТаблицаДатДляСреднегодовой = Новый ТаблицаЗначений();
	ТаблицаДатДляСреднегодовой.Колонки.Добавить("НомерМесяца", Новый ОписаниеТипов("Число"));
	ТаблицаДатДляСреднегодовой.Колонки.Добавить("ДатаОценки", Новый ОписаниеТипов("Дата"));
	
	СтрокаДаты = ТаблицаДатДляСреднегодовой.Добавить();
	СтрокаДаты.НомерМесяца = 0;
	СтрокаДаты.ДатаОценки = КонецДня(Дата(Год(Период) - 1, 12, 31));
	
	Для НомерМесяца = 1 по 12 Цикл
		СтрокаДаты = ТаблицаДатДляСреднегодовой.Добавить();
		СтрокаДаты.НомерМесяца = НомерМесяца;
		СтрокаДаты.ДатаОценки = КонецМесяца(Дата(Год(Период), НомерМесяца, 1));
	КонецЦикла;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаДатДляСреднегодовой, "_ТаблицаДатДляСреднегодовой", Запрос.МенеджерВременныхТаблиц);
	
	#Область ЗапросРасчетПоСреднегодовой
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_РеквизитыОбъектовНедвижимости.РасчетПоКадастровойСтоимости КАК РасчетПоКадастровойСтоимости,
		|	_РеквизитыОбъектовНедвижимости.СтавкаНалога КАК СтавкаНалога,
		|	_РеквизитыОбъектовНедвижимости.КодОКТМО КАК КодОКТМО,
		|	_ИмуществоИДатыПоступленияВыбытия.НачалоПериода КАК НачалоПериода,
		|	_ИмуществоИДатыПоступленияВыбытия.ОкончаниеПериода КАК ОкончаниеПериода,
		|	_ИмуществоИДатыПоступленияВыбытия.ДатаВыбытия КАК ДатаВыбытия
		|ПОМЕСТИТЬ _ПериодыРасчетапоСреднегодовой
		|ИЗ
		|	_ИмуществоИДатыПоступленияВыбытия КАК _ИмуществоИДатыПоступленияВыбытия
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОбъектовНедвижимости КАК _РеквизитыОбъектовНедвижимости
		|		ПО _ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости = _РеквизитыОбъектовНедвижимости.ОбъектНедвижимости
		|ГДЕ
		|	НЕ _РеквизитыОбъектовНедвижимости.РасчетПоКадастровойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ТаблицаДатДляСреднегодовой.ДатаОценки КАК ДатаОценки
		|ПОМЕСТИТЬ _ДатыДляРасчетаСреднегодовой
		|ИЗ
		|	_ПериодыРасчетапоСреднегодовой КАК _ПериодыРасчетапоСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаДатДляСреднегодовой КАК _ТаблицаДатДляСреднегодовой
		|		ПО _ПериодыРасчетапоСреднегодовой.НачалоПериода <= _ТаблицаДатДляСреднегодовой.ДатаОценки
		|			И _ПериодыРасчетапоСреднегодовой.ОкончаниеПериода >= _ТаблицаДатДляСреднегодовой.ДатаОценки
		|ГДЕ
		|	НЕ _ПериодыРасчетапоСреднегодовой.РасчетПоКадастровойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыДляРасчетаСреднегодовой.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ДатыДляРасчетаСреднегодовой.ДатаОценки КАК ДатаОценки,
		|	МАКСИМУМ(ОценкиСтоимостиПрочихАктивов.Период) КАК Период
		|ПОМЕСТИТЬ _ДатыОценочныхСтоимостей
		|ИЗ
		|	_ДатыДляРасчетаСреднегодовой КАК _ДатыДляРасчетаСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов КАК ОценкиСтоимостиПрочихАктивов
		|		ПО _ДатыДляРасчетаСреднегодовой.ОбъектНедвижимости = ОценкиСтоимостиПрочихАктивов.СубъектАналитики
		|			И (ОценкиСтоимостиПрочихАктивов.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость))
		|			И _ДатыДляРасчетаСреднегодовой.ДатаОценки >= ОценкиСтоимостиПрочихАктивов.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыДляРасчетаСреднегодовой.ОбъектНедвижимости,
		|	_ДатыДляРасчетаСреднегодовой.ДатаОценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	СУММА(ВЫБОР
		|			КОГДА _ПериодыРасчетапоСреднегодовой.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					И _ПериодыРасчетапоСреднегодовой.ДатаВыбытия < _ПериодыРасчетапоСреднегодовой.ОкончаниеПериода
		|					И _ПериодыРасчетапоСреднегодовой.ДатаВыбытия < _ТаблицаДатДляСреднегодовой.ДатаОценки
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ОценкиСтоимостиПрочихАктивов.Стоимость, 0)
		|		КОНЕЦ) КАК Стоимость,
		|	_ТаблицаДатДляСреднегодовой.ДатаОценки КАК ДатаОценки
		|ПОМЕСТИТЬ _ОценочныеСтоимостиДляРасчета
		|ИЗ
		|	_ПериодыРасчетапоСреднегодовой КАК _ПериодыРасчетапоСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаДатДляСреднегодовой КАК _ТаблицаДатДляСреднегодовой
		|		ПО _ПериодыРасчетапоСреднегодовой.ОкончаниеПериода >= _ТаблицаДатДляСреднегодовой.ДатаОценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыОценочныхСтоимостей КАК _ДатыОценочныхСтоимостей
		|		ПО (_ТаблицаДатДляСреднегодовой.ДатаОценки = _ДатыОценочныхСтоимостей.ДатаОценки)
		|			И _ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости = _ДатыОценочныхСтоимостей.ОбъектНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов КАК ОценкиСтоимостиПрочихАктивов
		|		ПО (_ДатыОценочныхСтоимостей.ОбъектНедвижимости = ОценкиСтоимостиПрочихАктивов.СубъектАналитики)
		|			И (_ДатыОценочныхСтоимостей.Период = ОценкиСтоимостиПрочихАктивов.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости,
		|	_ТаблицаДатДляСреднегодовой.ДатаОценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости, _АвансовыеПлатежи.ОбъектНедвижимости) КАК ОбъектНедвижимости,
		|	_ПериодыРасчетапоСреднегодовой.КодОКТМО КАК КодОКТМО,
		|	_ПериодыРасчетапоСреднегодовой.СтавкаНалога КАК СтавкаНалога,
		|	ЕСТЬNULL(_ОценочныеСтоимостиДляРасчета.Стоимость, 0) КАК Стоимость,
		|	_ОценочныеСтоимостиДляРасчета.ДатаОценки КАК ДатаОценки,
		|	ЕСТЬNULL(_АвансовыеПлатежи.СуммаОборот, 0) КАК СуммаАванса
		|ПОМЕСТИТЬ _РасчетНалогаПоСреднегодовойСтоимости
		|ИЗ
		|	_ПериодыРасчетапоСреднегодовой КАК _ПериодыРасчетапоСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОценочныеСтоимостиДляРасчета КАК _ОценочныеСтоимостиДляРасчета
		|		ПО _ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости = _ОценочныеСтоимостиДляРасчета.ОбъектНедвижимости
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_АвансовыеПлатежи.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|			СУММА(_АвансовыеПлатежи.СуммаОборот) КАК СуммаОборот
		|		ИЗ
		|			_АвансовыеПлатежи КАК _АвансовыеПлатежи
		|		ГДЕ
		|			НЕ _АвансовыеПлатежи.РасчетНалогаПоКадастровойСтоимости
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_АвансовыеПлатежи.ОбъектНедвижимости) КАК _АвансовыеПлатежи
		|		ПО _ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости = _АвансовыеПлатежи.ОбъектНедвижимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоСреднегодовойСтоимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ВЫРАЗИТЬ(_РасчетНалогаПоСреднегодовойСтоимости.ОбъектНедвижимости КАК Справочник.ОбъектыНедвижимости).Представление КАК ОбъектНедвижимостиПредставление,
		|	_РасчетНалогаПоСреднегодовойСтоимости.СтавкаНалога = 0 КАК НеУказанаСтавкаНалога,
		|	_РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО = """" КАК НеУказанКодОКТМО
		|ИЗ
		|	_РасчетНалогаПоСреднегодовойСтоимости КАК _РасчетНалогаПоСреднегодовойСтоимости
		|ГДЕ
		|	(_РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО = """"
		|			ИЛИ _РасчетНалогаПоСреднегодовойСтоимости.СтавкаНалога = 0)";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НеУказанКодОКТМО Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + Выборка.ОбъектНедвижимостиПредставление 
				+ " не указан код ОКТМО!", Выборка.ОбъектНедвижимости,,, Отказ);
		КонецЕсли;
		Если Выборка.НеУказанаСтавкаНалога Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + Выборка.ОбъектНедвижимостиПредставление 
				+ " не указана ставка налога!", Выборка.ОбъектНедвижимости,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьНалогНаИмущество(Период, Организация, СчетДоверительногоУправления, Отказ, Расшифровка) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	ПолучитьИмуществоИДатыПоступленияВыбытия(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ);
	
	Если Отказ Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ПолучитьАвансовыеПлатежиИРеквизитыОбъектов(Период, Организация, СчетДоверительногоУправления, Запрос);
	
	РассчитатьНалогНаИмуществоПоКадастровойСтоимости(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ);
	РассчитатьНалогНаИмуществоПоСреднегодовойСтоимости(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ);
	
	Если Отказ Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	#Область ЗапросСвернутьДанныеПоСреднегодовойДляДекларации
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО КАК КодОКТМО,
		|	_РасчетНалогаПоСреднегодовойСтоимости.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(_РасчетНалогаПоСреднегодовойСтоимости.Стоимость) КАК СтоимостьПоЛистуДекларации,
		|	_РасчетНалогаПоСреднегодовойСтоимости.ДатаОценки КАК ДатаОценки,
		|	СУММА(ЕСТЬNULL(_АвансовыеПлатежи.СуммаОборот, 0)) КАК СуммаАванса,
		|	_РасчетНалогаПоСреднегодовойСтоимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|ПОМЕСТИТЬ _РасчетСтоимостиНаДаты
		|ИЗ
		|	_РасчетНалогаПоСреднегодовойСтоимости КАК _РасчетНалогаПоСреднегодовойСтоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_РеквизитыОбъектовНедвижимости.КодОКТМО КАК КодОКТМО,
		|			СУММА(_АвансовыеПлатежи.СуммаОборот) КАК СуммаОборот
		|		ИЗ
		|			_АвансовыеПлатежи КАК _АвансовыеПлатежи
		|				ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОбъектовНедвижимости КАК _РеквизитыОбъектовНедвижимости
		|				ПО _АвансовыеПлатежи.ОбъектНедвижимости = _РеквизитыОбъектовНедвижимости.ОбъектНедвижимости
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_РеквизитыОбъектовНедвижимости.КодОКТМО) КАК _АвансовыеПлатежи
		|		ПО _РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО = _АвансовыеПлатежи.КодОКТМО
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасчетНалогаПоСреднегодовойСтоимости.ОбъектНедвижимости,
		|	_РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО,
		|	_РасчетНалогаПоСреднегодовойСтоимости.ДатаОценки,
		|	_РасчетНалогаПоСреднегодовойСтоимости.СтавкаНалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыОбъектовНедвижимости.КодОКТМО КАК КодОКТМО,
		|	_РеквизитыОбъектовНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	СУММА(_АвансовыеПлатежи.СуммаОборот) КАК СуммаОборот
		|ПОМЕСТИТЬ _АвансовыеПлатежиСвернутые
		|ИЗ
		|	_АвансовыеПлатежи КАК _АвансовыеПлатежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОбъектовНедвижимости КАК _РеквизитыОбъектовНедвижимости
		|		ПО _АвансовыеПлатежи.ОбъектНедвижимости = _РеквизитыОбъектовНедвижимости.ОбъектНедвижимости
		|
		|СГРУППИРОВАТЬ ПО
		|	_РеквизитыОбъектовНедвижимости.ОбъектНедвижимости,
		|	_РеквизитыОбъектовНедвижимости.КодОКТМО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоСреднегодовой.КодОКТМО КАК КодОКТМО,
		|	_РасчетНалогаПоСреднегодовой.СтавкаНалога КАК СтавкаНалога,
		|	_РасчетНалогаПоСреднегодовой.БазаНалога КАК БазаНалога,
		|	_РасчетНалогаПоСреднегодовой.СуммаНалога КАК СуммаНалога,
		|	ЕСТЬNULL(_АвансовыеПлатежиСвернутые.СуммаОборот, 0) КАК СуммаАванса,
		|	_РасчетНалогаПоСреднегодовой.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ЛОЖЬ КАК РасчетПоКадастровойСтоимости
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РасчетСтоимостиНаДаты.КодОКТМО КАК КодОКТМО,
		|		_РасчетСтоимостиНаДаты.СтавкаНалога КАК СтавкаНалога,
		|		ВЫРАЗИТЬ(СУММА(_РасчетСтоимостиНаДаты.СтоимостьПоЛистуДекларации) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _РасчетСтоимостиНаДаты.ДатаОценки) КАК ЧИСЛО(15, 2)) КАК БазаНалога,
		|		ВЫРАЗИТЬ((ВЫРАЗИТЬ(СУММА(_РасчетСтоимостиНаДаты.СтоимостьПоЛистуДекларации) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _РасчетСтоимостиНаДаты.ДатаОценки) КАК ЧИСЛО(15, 2))) * _РасчетСтоимостиНаДаты.СтавкаНалога / 100 * ВЫБОР
		|				КОГДА &КонецПериода <> КОНЕЦПЕРИОДА(&КонецПериода, ГОД)
		|					ТОГДА 1 / 4
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНалога,
		|		_РасчетСтоимостиНаДаты.ОбъектНедвижимости КАК ОбъектНедвижимости
		|	ИЗ
		|		_РасчетСтоимостиНаДаты КАК _РасчетСтоимостиНаДаты
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_РасчетСтоимостиНаДаты.ОбъектНедвижимости,
		|		_РасчетСтоимостиНаДаты.КодОКТМО,
		|		_РасчетСтоимостиНаДаты.СтавкаНалога) КАК _РасчетНалогаПоСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АвансовыеПлатежиСвернутые КАК _АвансовыеПлатежиСвернутые
		|		ПО _РасчетНалогаПоСреднегодовой.ОбъектНедвижимости = _АвансовыеПлатежиСвернутые.ОбъектНедвижимости
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_РасчетНалогаПоКадастровойСтоимости.КодОКТМО,
		|	_РасчетНалогаПоКадастровойСтоимости.СтавкаНалога,
		|	_РасчетНалогаПоКадастровойСтоимости.БазаНалога,
		|	_РасчетНалогаПоКадастровойСтоимости.СуммаНалога,
		|	_РасчетНалогаПоКадастровойСтоимости.СуммаАванса,
		|	_РасчетНалогаПоКадастровойСтоимости.ОбъектНедвижимости,
		|	ИСТИНА
		|ИЗ
		|	_РасчетНалогаПоКадастровойСтоимости КАК _РасчетНалогаПоКадастровойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОценочныеСтоимостиДляРасчета.ДатаОценки КАК ДатаОценки
		|ПОМЕСТИТЬ _ДатыОценкиИмущества
		|ИЗ
		|	_ОценочныеСтоимостиДляРасчета КАК _ОценочныеСтоимостиДляРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные.КодОКТМО КАК КодОКТМО,
		|	_Данные.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(_Данные.БазаНалога) КАК БазаНалога,
		|	ВЫРАЗИТЬ(СУММА(_Данные.СуммаНалога) КАК ЧИСЛО(15, 0)) КАК СуммаНалога,
		|	СУММА(_Данные.СуммаАванса) КАК СуммаАванса,
		|	_Данные.РасчетПоКадастровойСтоимости КАК РасчетПоКадастровойСтоимости,
		|	МИНИМУМ(_Данные.ОбъектНедвижимости) КАК ОбъектНедвижимости
		|ИЗ
		|	_Данные КАК _Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	_Данные.КодОКТМО,
		|	_Данные.СтавкаНалога,
		|	_Данные.РасчетПоКадастровойСтоимости";
	
	
	#КонецОбласти
	
	Если Расшифровка Тогда 
		РезультатЗапроса = Запрос.Выполнить();
		
		Результат = Новый Структура; 
		
		Результат.Вставить("ТаблицаДанные", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Данные").ПолучитьДанные().Выгрузить());
		Результат.Вставить("ТаблицаСтоимостей", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ОценочныеСтоимостиДляРасчета").ПолучитьДанные().Выгрузить());
		Результат.Вставить("СписокДатОценки", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДатыОценкиИмущества").ПолучитьДанные().Выгрузить().ВыгрузитьКолонку("ДатаОценки"));
		Результат.Вставить("ПериодыРасчетаПоКадастру", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ПериодыРасчетаПоКадастру").ПолучитьДанные().Выгрузить());
		Результат.Вставить("РасчетНалогаПоКадастровойПоКварталам", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РасчетНалогаПоКадастровойПоКварталам").ПолучитьДанные().Выгрузить());
		
		Возврат Результат;
		
	Иначе 
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
		
КонецФункции

&НаСервере
Процедура ПолучитьДанныеДляРасчетаИнвестВычета(ПогашенияПаев, МенеджерВременныхТаблиц) Экспорт 

	// вызывается из документа Расчет НДФЛ Пайщиков, заполнение табличной часи. 
	// и из Отчета Справка-Расчет на дату погашения паев        
	// таблица _ПартииПредварительно сделана для того, чтобы упростить формулы в таблице _Партии
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;  
	
	Запрос.УстановитьПараметр("ПогашенияПаев", ПогашенияПаев);
	Запрос.УстановитьПараметр("ОграничениеСуммыИнвестВычета", 3000000);
	Запрос.УстановитьПараметр("МинимальныйСрокПартии", 3);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПогашениеПаевПартии.Ссылка.Пайщик КАК Пайщик,
	|	ПогашениеПаевПартии.Ссылка КАК Погашение,
	|	ПогашениеПаевПартии.ЗачислениеПаев КАК ЗачислениеПаев,
	|	ПогашениеПаевПартии.ЗачислениеПаев.Дата КАК ДатаПокупки,
	|	ПогашениеПаевПартии.ЗачислениеПаев.Заявка.НомерЗаявки КАК НомерЗаявки,
	|	ПогашениеПаевПартии.ЗачислениеПаев.Заявка.Дата КАК ДатаЗаявки,
	|	ПогашениеПаевПартии.КоличествоПаев КАК КоличествоПаев,
	|	ПогашениеПаевПартии.ЗачислениеПаев.СуммаНадбавки * ПогашениеПаевПартии.КоличествоПаев / ПогашениеПаевПартии.ЗачислениеПаев.Количество КАК СуммаНадбавки,
	|	ПогашениеПаевПартии.СтоимостьПокупки КАК СтоимостьПокупки,
	|	ПогашениеПаевПартии.СтоимостьПокупки / ПогашениеПаевПартии.КоличествоПаев КАК Цена,
	|	ПогашениеПаевПартии.СуммаПогашения КАК СуммаПогашения,
	|	ПогашениеПаевПартии.СрокВладения КАК СрокВладения,
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ПогашениеПаевПартии.ЗачислениеПаев КАК Документ.ЗачислениеПаев).Дата, ПогашениеПаевПартии.Ссылка.Дата, ГОД), 0) КАК СрокВладенияГод,
	|	ПогашениеПаевПартии.ПроцентСкидки КАК ПроцентСкидки,
	|	ПогашениеПаевПартии.СуммаСкидки КАК СуммаСкидки,
	|	ПогашениеПаевПартии.Ссылка.ПаевойИнвестиционныйФонд КАК ПИФ,
	|	ПогашениеПаевПартии.Ссылка.Заявка КАК Заявка,
	|	ВЫБОР
	|		КОГДА ПогашениеПаевПартии.СуммаПогашения - ПогашениеПаевПартии.СтоимостьПокупки - ПогашениеПаевПартии.СуммаСкидки - ПогашениеПаевПартии.ЗачислениеПаев.СуммаНадбавки > 0
	|			ТОГДА ПогашениеПаевПартии.СуммаПогашения - ПогашениеПаевПартии.СтоимостьПокупки - ПогашениеПаевПартии.СуммаСкидки - ПогашениеПаевПартии.ЗачислениеПаев.СуммаНадбавки * ПогашениеПаевПартии.КоличествоПаев / ПогашениеПаевПартии.ЗачислениеПаев.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Прибыль,
	|	ФинансовыеПоказатели.Значение КАК СтоимостьПаяИзСЧА
	|ПОМЕСТИТЬ _ПартииПредварительно
	|ИЗ
	|	Документ.ПогашениеПаев.Партии КАК ПогашениеПаевПартии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
	|		ПО ПогашениеПаевПартии.Ссылка.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
	|			И (НАЧАЛОПЕРИОДА(ПогашениеПаевПартии.Ссылка.Заявка.Дата, ДЕНЬ) = ФинансовыеПоказатели.Период)
	|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
	|ГДЕ
	|	ПогашениеПаевПартии.Ссылка В(&ПогашенияПаев)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПартииПредварительно.Пайщик КАК Пайщик,
	|	_ПартииПредварительно.Погашение КАК Погашение,
	|	_ПартииПредварительно.ЗачислениеПаев КАК ЗачислениеПаев,
	|	_ПартииПредварительно.ДатаПокупки КАК ДатаПокупки,
	|	_ПартииПредварительно.НомерЗаявки КАК НомерЗаявки,
	|	_ПартииПредварительно.ДатаЗаявки КАК ДатаЗаявки,
	|	_ПартииПредварительно.КоличествоПаев КАК КоличествоПаев,
	|	_ПартииПредварительно.СуммаНадбавки КАК СуммаНадбавки,
	|	_ПартииПредварительно.СтоимостьПокупки КАК СтоимостьПокупки,
	|	_ПартииПредварительно.Цена КАК Цена,
	|	_ПартииПредварительно.СуммаПогашения КАК СуммаПогашения,
	|	_ПартииПредварительно.СрокВладения КАК СрокВладения,
	|	_ПартииПредварительно.СрокВладенияГод КАК СрокВладенияГод,
	|	_ПартииПредварительно.ПроцентСкидки КАК ПроцентСкидки,
	|	_ПартииПредварительно.СуммаСкидки КАК СуммаСкидки,
	|	_ПартииПредварительно.ПИФ КАК ПИФ,
	|	_ПартииПредварительно.Заявка КАК Заявка,
	|	_ПартииПредварительно.Прибыль КАК Прибыль,
	|	_ПартииПредварительно.СтоимостьПаяИзСЧА КАК СтоимостьПаяИзСЧА,
	|	ВЫБОР
	|		КОГДА _ПартииПредварительно.СрокВладенияГод >= &МинимальныйСрокПартии
	|			ТОГДА _ПартииПредварительно.Прибыль
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Vi,
	|	ВЫБОР
	|		КОГДА _ПартииПредварительно.СрокВладенияГод >= &МинимальныйСрокПартии
	|			ТОГДА _ПартииПредварительно.Прибыль * _ПартииПредварительно.СрокВладенияГод
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Vi_x_i
	|ПОМЕСТИТЬ _Партии
	|ИЗ
	|	_ПартииПредварительно КАК _ПартииПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДляРасчетаВычета.Погашение КАК Погашение,
	|	ДанныеДляРасчетаВычета.Vi КАК Vi,
	|	ДанныеДляРасчетаВычета.Vi_x_i КАК Vi_x_i,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаВычета.Vi > 0
	|			ТОГДА ДанныеДляРасчетаВычета.Vi_x_i / ДанныеДляРасчетаВычета.Vi
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Кцб,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаВычета.Vi > 0
	|			ТОГДА ВЫРАЗИТЬ(&ОграничениеСуммыИнвестВычета * ДанныеДляРасчетаВычета.Vi_x_i / ДанныеДляРасчетаВычета.Vi КАК ЧИСЛО(19, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МаксимальныйВычет
	|ПОМЕСТИТЬ _ИнвестиционныйВычет
	|ИЗ
	|	(ВЫБРАТЬ
	|		_Партии.Погашение КАК Погашение,
	|		СУММА(_Партии.Vi) КАК Vi,
	|		СУММА(_Партии.Vi_x_i) КАК Vi_x_i
	|	ИЗ
	|		_Партии КАК _Партии
	|	
	|	СГРУППИРОВАТЬ ПО
	|		_Партии.Погашение) КАК ДанныеДляРасчетаВычета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _ПартииПредварительно";
	
	
	Запрос.Выполнить();
	
	
КонецПроцедуры
